Matlab/README.org
#+TITLE: Simulation code for a simple reaction diffusion equation

* Presentation
  
  We simulate a chemical system with three component and the a single chemical reaction  A + B -> C

  Each component is spatially resolved and can diffuse

  The simulator setup is based on BattMo developed at SINTEF which provides generic tools for simulation electro
  chemical system.
  
* Installation

  - Install [[https://github.com/BattMoTeam/BattMo][BattMo]]. Follow the [[https://github.com/BattMoTeam/BattMo#installation][installation instruction]] from the webpage
  - Add the directories ~Models~ and ~Examples~ in your MATLAB path (or run ~startup~ script)

    Then, you should be able to run the two scripts ~runTest1D~ and ~runTest2D~ from the ~Examples~ directory.
        
