README.md

# Table of Contents

1.  [Presentation](#org81fa71d)
2.  [Installation](#org70fca4a)



<a id="org81fa71d"></a>

# Presentation

We simulate a chemical system with three component and the a single chemical reaction  A + B -> C

Each component is spatially resolved and can diffuse

The simulator setup is based on BattMo developed at SINTEF which provides generic tools for simulation electro
chemical system.


<a id="org70fca4a"></a>

# Installation

-   Install [BattMo](https://github.com/BattMoTeam/BattMo). Follow the [installation instruction](https://github.com/BattMoTeam/BattMo#installation) from the webpage
-   Add the directories `Models` and `Examples` in your MATLAB path (or run `startup` script)
    
    Then, you should be able to run the two scripts `runTest1D` and `runTest2D` from the `Examples` directory.

